class Product {
  final int id, price;
  final String title, subTitle, description, image;

  Product({
    required this.id,
    required this.price,
    required this.title,
    required this.subTitle,
    required this.description,
    required this.image,
  });

  Product? operator [](int other) {}
}

List<Product> product = [
  Product(
    id: 1,
    price: 50,
    title: 'سماعات لاسلكية',
    subTitle: 'سماعات عالية الجوده ينصح بشرائها  ',
    description:
        'استمتع بتجربة صوتية غامرة مع السماعات اللاسلكية الجديدة التي تجمع بين التصميم العصري والأداء الفائق. تم تصميم هذه السماعات لتوفر لك حرية الحركة الكاملة دون الحاجة لأي أسلاك، مما يجعلها الخيار المثالي للتمارين الرياضية، المكالمات اليومية، أو الاستمتاع بالموسيقى في أي وقت وأي مكان. تتميز بجودة صوت عالية الدقة، مع جهير قوي ونقي يضمن لك تجربة استماع مميزة لجميع أنواع الموسيقى.',
    image: 'assets/images/airpod.jpg',
  ),
  Product(
    id: 2,
    price: 2000,
    title: ' جهاز موبايل',
    subTitle: 'جودة الحهاز عالية  ',
    description:
        'عيش تجربة لا مثيل لها مع أحدث إصدار من أجهزة iPhone الذي يجمع بين التصميم الفاخر والأداء القوي والتكنولوجيا المتقدمة. يأتي هذا الهاتف بهيكل أنيق مصنوع من مواد عالية الجودة تمنحه مظهراً فخماً وشعوراً مميزاً عند الاستخدام. تم تصميمه بعناية ليكون نحيفاً، خفيف الوزن، وسهل الحمل في اليد، مع شاشة مذهلة تمتد من الحافة إلى الحافة لتمنحك ألواناً واقعية وتفاصيل غنية تجعل كل تجربة مشاهدة ممتعة سواء كنت تشاهد فيديوهات، تتصفح الإنترنت، أو تلعب الألعاب.',
    image: 'assets/images/ph.jpg',
  ),
  Product(
    id: 3,
    price: 100,
    title: ' نضارات ثلاثية الابعاد',
    subTitle: 'لننقبك الى العالم  الافتراضي ',
    description:
        'استمتع بتجربة غامرة وواقعية مع نظارة ثلاثية الأبعاد عالية الدقة، صممت لتمنحك عمقاً مذهلاً وراحة فائقة بفضل تصميمها الخفيف والوسائد القابلة للتعديل. تتوافق مع معظم الهواتف الذكية لتتيح لك مشاهدة الأفلام، الألعاب، والجولات الافتراضية بسهولة، لتجمع بين الترفيه، التعلم، والتجارب الواقعية في جهاز واحد.',
    image: 'assets/images/3D.jpg',
  ),
  Product(
    id: 4,
    price: 10,
    title: ' سماعات',
    subTitle: ' استمتع لساعات طويلة',
    description:
        'استمتع بصوت واضح ونقي مع هذه السماعات العادية المصممة لتوفير تجربة استماع مريحة يومياً. تتميز بتصميم مريح وخفيف يناسب جميع الأذن، مع جودة صوت ممتازة تجعل الموسيقى والمكالمات أكثر وضوحاً وحيوية. سهلة الاستخدام ومتوافقة مع معظم الأجهزة، لتكون رفيقك المثالي للاستماع في أي وقت وأي مكان.',
    image: 'assets/images/sommat.jpg',
  ),
];
